#include <iostream>
#include <vector>
#include <vector>
#include <vector>
#include <string>
#include <string>
#include <string>
#include <algorithm>
#include <algorithm>
#include <algorithm>
#include <algorithm>
#include <algorithm>

using namespace std;
//используем пространство имен std для сокращения кода
using namespace std;
//Используем пространство имен std для сокращения кода
using namespace std;
//Используем пространство имен std для сокращения кода
using namespace std;

//Класс для представления одной задачи
class Task {}
//Класс для представления одной задачи
class Task {}
//Так, а теперь запишем свои мысли. Почему отец такой конченный?
//у него мозги совсем сгнили или что? Он вообще соображает? А, я оцениваю его свей логикой
//интеллекта и честности, взаимопомощи. У него просто отсутствует эмпатия.
//то есть я заставлял рыбу плавать и ждал от него той отдачи, 
//которую я вкладывал. а он все принимает как должное.
//он не понимает что что-то не так потому что его окружение создало точно
//такое же отношение к жизни. это первый человек чьей смерти я желаю
//и со зла и просто так. я испытываю ненависть и желание убить его.
//то есть мои намерения стали слишком жестче - как показано на животных
//которых я вывез от греха подальше.